import Foundation

struct ConceptDummy {
    var titleText = "알 수 없는 4차원 매력의 소유자"
    var charactorText = "모스"
    var charactorDescriptText = "뚜렷한 주관을 갖고 자신만의 방식으로 세상을\n이해하며 누구보다 순수한 열정을 가진 모스!"
    var titles: [String] = [
        "의\n장점과 단점이\n궁금해요 !",
        "의\n습관은 무엇인지\n궁금해요 !",
        "의\n자주 하는 행동은\n무엇인가요?!",
        "의\n어떤 가치관을\n갖고있나요?",
        "의\n최애 플레이 리스트를\n알고싶어요!"
    ]
    
    var contentText: [String] = [
        "집중력 하나는 최고! 한 번 집중하면 주변의 어떤 소리도\n들리지 않을 정도로 집중하는 성격이에요.\n그래서 일 외에는 주변을 잘 챙기지 못하기도 해요.",
        "상대방의 이름을 잘 기억하고 이름을 부르며 꼬박꼬박\n안부 인사를 하는 것이 모스의 습관 중 하나에요.\n모스를 안부 인사와 함께 즐거운 하루를 보내볼까요?",
        "모스는 집중을 할 때면 사람들과 떨어져 혼자만의\n공간으로 이동해서 생각을 정리하는 편이에요.\n특히 옥상을 가서 하늘을 보며 긴장을 풀곤 한답니다!",
        "‘무언가를 좋아한다면 하지 않을 이유가 없다!’\n라는 가치관을 갖고 있어요. 스스로 무언가를 개척하고\n이뤄내는 것을 두려워 하지 않으려고 노력해요."
    ]
    
    var titleHightLightText: [String] = [
        "장점과 단점이",
        "습관은 무엇인지",
        "자주 하는 행동은",
        "어떤 가치관을",
        "최애 플레이 리스트를",
    ]
    
    var songTitle: [String] = [
        "위잉위잉",
        "Be My Mistake",
    ]
    
    var artists: [String] = [
        "혁오",
        "the 1975"
    ]
}
